<template>
    <div class="m-cj-intro">
        <div class="u-title">
            <el-icon class="u-tab-icon"><Compass></Compass></el-icon><b>背景特色</b>
        </div>
        <div class="u-info" v-html="getData()"></div>
    </div>
</template>

<script>
import { markRaw } from "vue";
import { useStore } from "@/store";
const $store = useStore();
export default {
    name: "CJMapIntro",
    components: {},
    data: function () {
        return {
            data: markRaw([
                {
                    id: 296,
                    name: "龙门绝境",
                    setting:
                        "<p>数百年前，鄯善国公主图兰凭借手中的烨阳刀、沙驰军和“十二飞沙”纵横西域。百年过后，秘宝再现。无数侠士前往大漠沙海，希望寻找到传说中的秘宝和失传绝学。</p>",
                    feature:
                        "<p>【驼铃】道具，使用后会在地图的某处出现 5 只移速过人的骆驼坐骑。队伍仅剩一人时，可通过采集叹息风碑掉落的“流萤返魂花”复活队友，仅能随机复活一人，且该道具无法在决赛圈中使用。</p>",
                },
                {
                    id: 297,
                    name: "龙门绝境·夜",
                    setting:
                        "<p>数百年前，鄯善国公主图兰凭借手中的烨阳刀、沙驰军和“十二飞沙”纵横西域。百年过后，秘宝再现。无数侠士前往大漠沙海，希望寻找到传说中的秘宝和失传绝学。</p>",
                    feature:
                        "<p>【驼铃】道具，使用后会在地图的某处出现 5 只移速过人的骆驼坐骑。队伍仅剩一人时，可通过采集叹息风碑掉落的“流萤返魂花”复活队友，仅能随机复活一人，且该道具无法在决赛圈中使用。</p>",
                },
                {
                    id: 410,
                    name: "沧溟绝境",
                    setting: `<p>大定元年,皇族宇文氏遭屠。香老人次子与师妹死于九天初代苍天君方有崖之手。</p>
                            <p>香老人痛心之余,欲将宇文乾雅家眷后裔护送至苗疆,却遭五仙教拒绝。遂夺走《毒蛊经》，自立香巫教,率弟子前往东海,漂流至一荒岛。再度凝望中原时，苍茫大海难以逾越,便将岛名改为沧溟。直至因缘际会下，探知仇人踪迹，率弟子前往东海，再未归来……</p>
                            <p>原来香老人不敌方有崖，九死一生漂流至东海之东的一片群岛。再度凝望中原时，苍茫大海难以逾越，便将岛名改为沧溟，伤重不治后离去。其女曦凰更擅长蛊惑人心，整个岛上的住民尽数归于香巫教，并被灌输向苍天君复仇的遗志。</p>
                            <p>就在曦凰准备好重新集结势力，欲再度进军东海时，触动了岛上尘封的祭坛，只见火山喷发引发海啸，让整个沧溟岛如它的名字一般，失落在漫天的水龙卷中……</p>`,
                    feature:
                        "<p>全新的海龙卷的加入令吃鸡的战场变得更加变幻莫测，与以往固定缩小的沙尘风圈不同，“沧溟绝境”的海龙卷不仅仅随着时间的推移而不断缩小，在其缩小的同时，还将随机的进行移动！优化复活机制，拾取【九转还魂草】使用可复活指定队友。使用道具【凌波草】可在水面行走。</p>",
                },
                {
                    id: 512,
                    name: "白龙绝境",
                    setting: `<p>在很长一段时间里，乌蒙贵的得力手下嗥汐，一直在西南深林中继续有关尸人的实验。当嗥汐敏锐觉察到因中原陷入战乱，南诏第五代王阁罗凤趁此机会不断扩张领土时，她觉得这是一个值得利用的好机会。</p>
                            <p>楫汐以用蛊术为阁罗凤挑选忠诚勇士为名，获得了阁罗凤的准许，在白龙口地区，正大光明开辟了一片杀戮之地。南诏的神兵、密宝、灵药，吸引众多武功不俗的侠客、身怀绝技的异人，他们在这一片寂静的深林中，展开厮杀，欲夺魁首。</p>
                            <p>而握汐的腐沼毒雾总悄无声息得将所有人包围......有些人比赛之初便被淘汰遣返，有些人夺魁后成为南诏之臣,有些人潜入其中仅为刺探情报，有些人夺取神兵密宝后潇洒而去，还有些人被毒雾侵蚀之后便消失得无影无踪……</p>`,
                    feature: `<p>“白龙绝境”准备期间，侠士可从地图中一览所有航线，并可主动点击选择其中一个航线出发，总计6条航线可供选择。小队内所有侠士将默认跟随队长选择，也可手动勾选切换，每位侠士均可预览所有队友选择的航线。</p>
                            <p>特有无间死斗玩法，每位侠士进入“白龙绝境”后都会携带1个绑定的“无间行者信物”。所有已重伤且自身拥有“无间行者信物”的侠士均可获得参与“无间死斗”的资格。</p>
                            <p>全局“白龙绝境”共开启5场“无间死斗”。开启时，所有已重伤侠士均可消耗自身拥有的“无间行者信物”复活进入“无间死斗”玩法当中。</p>
                            <p>进入“无间死斗”后，侠士将保留组队关系，开启淘汰乱斗。当淘汰人数达到场内人数一半（向上取整)，或在“无间死斗”场内仅剩一支小队未被淘汰时，未被淘汰的侠士将恢复满状态,并将随机在其任一存活队友身边返回“白龙绝境”，而“白龙绝境”中无存活队友的回归侠士将在地图中未受到“腐沼毒雾”侵袭的随机位置返回。</p>
                            <p>“无间死斗”期间将随时间的推进出现“蚀骨怨寒”并不断增强，面场上侠士将不受“白龙绝境”中“腐沼毒雾”的影响。</p>`,
                },
                {
                    id: 532,
                    name: "天原绝境",
                    setting: `<p>长自山的东北冰原，地形复杂，天气变幻无常，若与狂风骤雪正面相遇，哪怕是内力深厚的武林人士也难以招架。</p>
                        <p>柳家、独孤家、长孙氏、绳池剑宗、武家恩怨颇深，历年来几家弟子若要下山历练，都需前往此地。绳池剑宗的两位与宗主同辈分的叔祖“卷丘”朴太闲与“大翅璐剑”崔路南在下山之时也被霸刀山庄庄主柳风骨捉到，遗恨于吞吴刀下。但在这里历练之后的生还者多半能有大进境，也算一块历练宝地。</p>
                        <p>这片冰原自远古以来便生产天材地宝，如老参丹株、精铁稀矿，又因几家恩仇对决，经常无可避免将来此寻宝的外人卷入，渐渐为北地武林所知，被北地武林称为“绝境天原”，等闲之人不敢轻易踏入。</p>`,
                    feature: `<p>冰天雪地的“天原绝境”为侠士们带来了诸多考验，其中最明显的当属温度系统!侠士在非战斗状态下静止不动时将降低自身温度，需保持移动或战斗状态下才能提升温度。在自身温度低于正常值时，将使自身出招变得缓慢，在失温后会逐渐扣减气血。</p>
                        <p>为了保持温暖，侠士可使用全新道具【燧石】点燃场景内的【干草堆】烤火取暖恢复温度，或可使用【火把】带来些微暖意。但用火需谨慎，【燧石】甚至还可点燃其他侠士哦!而烤火时也请留心风雪来袭，暴风雪过境时小小的取暖篝火可是会熄灭的!<</p>
                        <p>此外“天原绝境”环境极为恶劣，还有风雪席卷令人难以抵挡。当侠士直面风雪时，温度将会下降，在持续受到凤雪袭击还将削减少量气血上限，在离开风雪圈后将逐渐恢复，因此还请多加注意!而在行至山谷地区时，还可能会遇到强劲的山谷风推动侠士强制移动!</p>
                        <p>马匪刷新分为红蓝两种，击败拾取其中一种物资后将无法拾取另一种的物资。马匪物资会掉落坐骑【战象】，交互后可乘骑战象使用3种战象技能。初始会赠送【玄冰之息】使用后2分钟内可免死一次，开局10分钟后无法使用。</p>`,
                },
                {
                    id: 645,
                    name: "洱海绝境",
                    setting: `<p>乾元二年，南诏王召开武林大会，香巫教借着沙壹之宾首席的乌蒙贵与南诏王达成了某些利益的置换。</p>
                            <p>随后，南诏王将苍山洱海的部分地区辟出，召八方豪杰前来角逐，又许下重奖予角逐至最后的勇士，一时间洱海刀光剑影难绝……</p>`,
                    feature: `<p>80位侠士单排参加，所有侠士在游戏内名称均为未知侠士，禁用近聊频道。</p>
                            <p>◆每场战斗将会有三次【南诏王的召唤】，开始前均会发布全图公告召集侠士参与。</p>
                            <p>◇处于脱战状态的侠士届时可直接点击使用背包中自动获得的【南诏王的信物】，进入决斗场地准备作战。</p>
                            <p>从【南诏王的召唤】中存活胜出的侠士们不仅可以将其中拾获的稀有装备直接带到【洱海绝境】继续使用，而且将会获得持续一段时间的隐身与毒圈免疫效果,期间攻击他人将立即失效。</p>
                            <p>进入场景自动获得【步步为营】和【洱海飞爪】，侠士提前在某处放置一个5分钟内隐形的【步步为营】，自身身受重伤时可立即在这处复活并获得一套基础绿色品质装备。</p>
                            <p>【步步为营】为一次性道具，且无法于【南诏王的召唤】中使用。【洱海绝境】地势复杂，既有崇山峻岭悬崖陡立，也有深潭幽幽岩谷赤红。【洱海飞爪】可充能3层使用，助你千里追击,飞掠迎敌!</p>
                            <p>该地图无需击溃马匪，刷新倒计时结束后即可拾取【劫掠的货物】!内含橙色品质装备与神秘道具，可助侠士一臂之力。</p>
                            <p>战斗越临近终章，则【劫掠的货物】价值越高!是逆风翻盘还是如虎添翼?或许你最需要的东西就在这里!</p>`,
                },
            ]),
        };
    },
    computed: {
        map() {
            return $store.map;
        },
    },
    methods: {
        getData() {
            const data = this.data.find((item) => item.id === this.map) || {};
            return data.setting + data.feature;
        },
    },
};
</script>
<style lang="less">
.m-cj-intro {
    margin-top: 20px;
    // max-width: 2120px;
    // height: @darksideTopHeight;
    .scrollbar(4px, #F9EACC, #333);
    overflow-y: auto;
    background-color: @bgColorDark1;
    border-radius: 10px;
    padding: 20px;
    box-sizing: border-box;
    color: @colorDark;
    @media screen and (max-width: 1680px) {
        max-width: calc(@darkMapW + 20px);
    }
    .u-title {
        .flex;
        gap: 5px;
        align-items: center;
        justify-content: flex-start;
        padding-bottom: 10px;
        border-bottom: 1px dashed #333;
    }
    .u-info {
        font-size: 12px;
        // p {
        //     text-indent: 2em;
        // }
    }
    .el-tabs__nav {
        .flex;
    }
    .el-tabs__item {
        .flex;
        align-items: center;
    }
    .el-tabs__content {
        .u-info {
            font-size: 14px;
            line-height: 2;
            p {
                text-indent: 2em;
                margin: 0;
            }
        }
    }
}
</style>
