export const raid_analysis_constant = {
    // 时间轴常量
    timeline_enable_mapId: [
        // 110级
        468,
        469, // 剑冢惊变
        477,
        478, // 梧桐山庄
        479,
        480, // 罗汉门
        476,
        481, // 梦入集真岛
        482,
        483,
        484, // 达摩洞
        489,
        490, // 月落三星
        518,
        519,
        520, // 白帝江关
        521,
        522, // 漳水南路
        559,
        560,
        561, // 雷域大泽
        563,
        564, // 武氏别院
        573,
        574,
        575, // 河阳之战
        // 120级
        586,
        587,
        588, // 西津渡
        596,
        597, // 沃石院
        598,
        599, // 镇海阁地井
        606,
        607, // 幽藤馆
        622,
        623, // 江天夜宴
        636,
        637,
        638, // 武狱黑牢
        639,
        640, // 鹿桥驿
        648,
        649,
        650, // 九老洞
        658,
        659, // 栖灵洞天
        668,
        669,
        670, // 冷龙峰
        686,
        687,
        688,
    ],
    bossName: {
        468: ["陈骇", "雾影千斩", "千机伞·拂晓", "千机伞·琉璃", "千机伞·落雨", "千机伞·飞星", "陈徽"],
        469: ["陈骇", "雾影千斩", "千机伞·拂晓", "千机伞·琉璃", "千机伞·落雨", "千机伞·飞星", "陈徽"],
        477: ["雀卿", "鸩鸟", "阮梅", "罗刀"],
        478: ["雀卿", "鸩鸟", "阮梅", "罗刀"],
        479: ["宓果", "刘细", "郝大雪"],
        480: ["宓果", "刘细", "郝大雪"],
        476: ["花子", "观勒", "天空"],
        481: ["花子", "观勒", "天空"],
        482: ["余晖", "宓桃", "武雪散", "鬼门针", "猿飞", "毗流驮迦·增长天王", "毗留博叉·广目天王", "岳琳", "岳琅"],
        483: [
            "余晖",
            "宓桃",
            "武雪散",
            "鬼门针",
            "猿飞",
            "毗流驮迦·增长天王",
            "毗留博叉·广目天王",
            "岳琳",
            "岳琅",
            "天欲宫弟子",
            "天欲宫男宠",
            "充能核心",
            "蜂群胖墩",
            "蜂群莽夫",
        ],
        484: [
            "余晖",
            "宓桃",
            "武雪散",
            "鬼门针",
            "猿飞",
            "毗流驮迦·增长天王",
            "毗留博叉·广目天王",
            "岳琳",
            "岳琅",
            "天欲宫弟子",
            "天欲宫男宠",
            "充能核心",
            "蜂群胖墩",
            "蜂群莽夫",
            "蜂群弩手",
            "提多罗吒·持国天王",
            "木人·乾闼婆",
        ],
        489: ["苏凤楼", "韩敬青", "藤原夕夏", "蝴蝶式神", "阵眼"],
        490: ["苏凤楼", "韩敬青", "藤原夕夏", "蝴蝶式神", "阵眼"],
        518: [
            "罗芬",
            "胡汤",
            "赵八嫂",
            "海荼",
            "天怒惊霆戟",
            "姜集苦",
            "宇文灭",
            "宫威",
            "十二连环坞高阶精英弓手",
            "宫傲",
        ],
        519: [
            "罗芬",
            "胡汤",
            "赵八嫂",
            "鱼木寨喽啰",
            "机关弩箭",
            "海荼",
            "天怒惊霆戟",
            "姜集苦",
            "宇文灭",
            "宫威",
            "十二连环坞高阶精英弓手",
            "宫傲",
        ],
        520: [
            "罗芬",
            "胡汤",
            "赵八嫂",
            "鱼木寨喽啰",
            "机关弩箭",
            "海荼",
            "天怒惊霆戟",
            "姜集苦",
            "宇文灭",
            "宫威",
            "十二连环坞高阶精英弓手",
            "宫傲",
            "尚水泡影",
        ],
        521: ["史孝", "曹达干", "阎清怀", "战车", "弩车"],
        522: ["史孝", "曹达干", "阎清怀", "战车", "弩车"],
        559: [
            "巨型尖吻凤",
            "衣旎",
            "桑乔",
            "悉达罗摩",
            "灵虫",
            "赐恩血瘤",
            "尸腐秽血草",
            "摄魂鬼虫",
            "秽血勇虫",
            "血蛊巢心",
            "月泉淮",
            "暗梦仙游剑",
            "曲云",
            "乌蒙贵",
            "黑条巨蛾",
            "蓄积的内力",
        ],
        560: [
            "巨型尖吻凤",
            "衣旎",
            "桑乔",
            "悉达罗摩",
            "灵虫",
            "赐恩血瘤",
            "尸腐秽血草",
            "摄魂鬼虫",
            "秽血勇虫",
            "血蛊巢心",
            "月泉淮",
            "暗梦仙游剑",
            "曲云",
            "乌蒙贵",
            "黑条巨蛾",
            "触手",
            "蓄积的内力",
            "食腐毒飞虫",
        ],
        561: [
            "巨型尖吻凤",
            "衣旎",
            "桑乔",
            "悉达罗摩",
            "灵虫",
            "赐恩血瘤",
            "尸腐秽血草",
            "摄魂鬼虫",
            "秽血勇虫",
            "血蛊巢心",
            "月泉淮",
            "暗梦仙游剑",
            "曲云",
            "乌蒙贵",
            "黑条巨蛾",
            "触手",
            "蓄积的内力",
            "亡命卫虫",
            "食腐毒飞虫",
        ],
        563: ["李君竹", "剑宗高级弟子", "解秀朝", "武云阙"],
        564: ["李君竹", "剑宗高级弟子", "解秀朝", "武云阙"],
        573: ["勒齐那", "阿阁诺", "周通忌", "狼牙精锐", "李秦授", "周贽", "常宿"],
        574: ["勒齐那", "阿阁诺", "周通忌", "狼牙精锐", "李秦授", "周贽", "常宿"],
        575: ["勒齐那", "阿阁诺", "周通忌", "狼牙精锐", "李秦授", "周贽", "狼牙持旗手", "常宿"],
        586: [
            "张景超",
            "张法雷",
            "刘展",
            "弓手指挥",
            "枪卫首领",
            "苏凤楼",
            "韩敬青",
            "藤原佑野",
            "四方结界",
            "李重茂",
            "永王叛军长枪兵",
            "一刀流精锐武士",
        ],
        587: [
            "张景超",
            "张法雷",
            "刘展",
            "弓手指挥",
            "枪卫首领",
            "斧卫首领",
            "苏凤楼",
            "凌雪阁杀手",
            "剧毒孢子",
            "韩敬青",
            "藤原佑野",
            "四方结界",
            "李重茂",
            "永王叛军长枪兵",
            "一刀流精锐武士",
            "永王叛军剑卫",
        ],
        588: [
            "张景超",
            "张法雷",
            "刘展",
            "弓手指挥",
            "弩手指挥",
            "枪卫首领",
            "斧卫首领",
            "苏凤楼",
            "凌雪阁杀手",
            "剧毒孢子",
            "另一个苏凤楼",
            "韩敬青",
            "藤原佑野",
            "四方结界",
            "李重茂",
            "永王叛军长枪兵",
            "一刀流精锐武士",
            "永王叛军剑卫",
            "镜影·李重茂",
        ],
        596: ["孟承", "吕一平", "时风"],
        597: ["孟承", "吕一平", "时风"],
        598: ["关八天", "苍森", "巨型何罗"],
        599: ["关八天", "苍森", "巨型何罗"],
        606: ["吴添明", "阵眼", "阵灵", "阵心", "藤原佑野", "藤原广嗣", "谢云流"],
        607: ["吴添明", "阵眼", "阵灵", "阵心", "藤原佑野", "藤原广嗣", "谢云流"],
        622: ["笑妆娘", "白兆霆", "邙赫达", "桑来照", "傅七殊"],
        623: ["笑妆娘", "白兆霆", "邙赫达", "桑来照", "傅七殊"],
        636: ["时风", "乐临川", "牛波", "黑熊", "鹰", "和正", "武云阙", "解兰舟", "翁幼之"],
        637: ["时风", "乐临川", "牛波", "黑熊", "鹰", "恶虎", "和正", "武云阙", "解兰舟", "翁幼之"],
        638: ["时风", "乐临川", "牛波", "黑熊", "鹰", "恶虎", "巨象", "和正", "武云阙", "解兰舟", "翁幼之", "囚魂心牢"],
        639: ["骨面天君", "曹毅", "辛万时", "弓箭兵", "长枪兵", "刀兵"],
        640: ["骨面天君", "曹毅", "辛万时", "弓箭兵", "长枪兵", "刀兵"],
        648: ["魏华", "钟不归", "寒山剑", "岑伤", "鬼筹", "麒麟", "暗梦仙体", "暗梦仙体的幻影"],
        649: [
            "魏华",
            "钟不归",
            "寒山剑",
            "岑伤",
            "幻念剑影",
            "鬼筹",
            "麒麟",
            "暗梦仙体",
            "暗梦仙体的幻影",
            "金翅鸟化身",
            "月泉淮",
        ],
        650: [
            "魏华",
            "钟不归",
            "寒山剑",
            "岑伤",
            "幻念剑影",
            "鬼筹",
            "麒麟",
            "灵护麒麟",
            "魔剑幻影",
            "暗梦仙体",
            "暗梦仙体的幻影",
            "金翅鸟化身",
            "月泉淮",
            "掩日",
        ],
        658: ["辛仕徽", "宣骄", "魏鑫"],
        659: ["辛仕徽", "宣骄", "魏鑫"],
        668: ["葛木寒", "戮夜游·刀盾兵", "雨轻红", "喜雅", "鹰眼客", "赤幽明", "赤厄明"],
        669: ["葛木寒", "戮夜游·刀盾兵", "戮夜游·锁链手", "雨轻红", "喜雅", "鹰眼客", "赤幽明", "赤厄明", "游荡黑影"],
        670: [
            "葛木寒",
            "戮夜游·刀盾兵",
            "戮夜游·锁链手",
            "戮夜游·弓箭手",
            "雨轻红",
            "喜雅",
            "鹰眼客",
            "赤幽明",
            "赤厄明",
            "游荡黑影",
            "灵蝶",
        ],
        686: ["骆耀阳", "韦柔丝", "宋泉", "冰晶花", "伍靖远", "苏什", "芭德"],
        687: ["骆耀阳", "韦柔丝", "宋泉", "冰晶花", "伍靖远", "苏什", "芭德"],
        688: [
            "骆耀阳",
            "韦柔丝",
            "逆心转脉",
            "地裂",
            "宋泉",
            "冰晶花",
            "水分身",
            "伍靖远",
            "苏什",
            "芭德",
            "图腾",
            "阵剑",
        ],
    },

    noChannel_skillId: {
        669: [37498, 37075, 37002],
        670: [37498, 37075, 37002],
        686: [38226, 38113, 38114],
        687: [38226, 38221, 38113, 38114],
        688: [38226, 38221, 38113, 38114],
    },

    templateTable: {
        669: {
            127357: "戮夜游·锁链手",
            127369: "戮夜游·刀盾兵",
            127348: "落冰",
            126934: "黑镜",
            127310: "漆黑泥沼",
            123781: "游荡黑影",
        },
        670: {
            127460: "戮夜游·锁链手",
            127464: "戮夜游·刀盾兵",
            127442: "落冰",
            126934: "黑镜",
            127434: "漆黑泥沼",
            127476: "游荡黑影",
        },
        686: {
            128368: "冰晶球",
            128440: "冰晶花",
            128581: "落石",
        },
        687: {
            129417: "冰晶花",
            129404: "冰晶球",
            129497: "落石",
            129510: "黄砂气旋",
        },
        688: {
            129535: "冰晶花",
            129523: "冰晶球",
            129600: "落石",
            129544: "水分身",
            129542: "地裂",
            129598: "逆心转脉",
            129540: "阵剑",
        },
    },
    // 查锅更常量
    // 注意10人请不要启用这个
    blame_enable_mapId: [669, 670, 687, 688],
    buffTable: {
        // 25人普通冷龙峰
        669: {
            17200: 8, // 精神匮乏，记录减疗超过40%的玩家
            17201: 8, // 耐力损耗，记录易伤超过40%的玩家
            27878: 3, // 风起潮涌
            28295: 3, // 狂躁的诺布心诀内力
            27922: 3, // 烈毒
            27940: 1, // 死寂
            27938: 4, // 悚然
            27939: 1, // 光耀炫目
            28267: 1, // 影秽
        },
        // 25人英雄冷龙峰
        670: {
            17200: 8, // 精神匮乏，记录减疗超过40%的玩家
            17201: 8, // 耐力损耗，记录易伤超过40%的玩家
            27878: 3, // 风起潮涌
            28295: 1, // 狂躁的诺布心诀内力
            27922: 3, // 烈毒
            27940: 1, // 死寂
            27937: 1, // 阴火弹
            27938: 4, // 悚然
            27939: 1, // 光耀炫目
            28267: 1, // 影秽
        },
        //25人普通一之窟
        687: {
            17200: 8, // 精神匮乏，记录减疗超过40%的玩家
            17201: 8, // 耐力损耗，记录易伤超过40%的玩家
            29056: 1, // 经脉不畅
            28972: 1, // 失血(30易伤)
            28862: 1, // 冻结(死亡前buff)
            28982: 1, // 沙尘入肺
            28985: 1, // 沙暴（玩家位置不对）
            29004: 1, // 气旋束缚（进入黄沙气旋）
        },
        //25人英雄一之窟
        688: {
            17200: 8, // 精神匮乏，记录减疗超过40%的玩家
            17201: 8, // 耐力损耗，记录易伤超过40%的玩家
            29056: 1, // 经脉不畅
            28972: 1, // 失血(30易伤)
            28862: 1, // 冻结(死亡前buff)
            28982: 1, // 沙尘入肺
            28985: 1, // 沙暴（玩家位置不对）
            29004: 1, // 气旋束缚（进入黄沙气旋）
            29027: 1, // 重伤（老一)
        },
    },
    buff2name: {
        17200: "精神匮乏",
        17201: "耐力损耗",
        27278: "风起潮涌",
        28295: "狂暴的诺布心决内力",
        27922: "烈毒",
        27940: "死寂",
        27938: "悚然",
        27939: "光耀炫目",
        27937: "阴火弹灼烧",
        28267: "影秽",
        29056: "经脉不畅",
        28972: "失血",
        28862: "冻结",
        28982: "沙尘入肺",
        28985: "沙暴",
        29004: "气旋束缚",
        29027: "重伤",
    },
};
